app/views/projects/view1.html.erb

SELECT "assigns".* FROM "assigns" WHERE "assigns"."project_id" = 2
---
         </div>
         <%if Assign.where(project_id:project).present?%>