app/controllers/assigns_controller.rb

  def index
   @project = Project.where(user_id: current_user.id)
   @tester = User.where(role: 'Tester')
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "Developer"]]