app/controllers/projects_controller.rb

  def create
    @user = User.find(current_user.id)
    authorize! :manage, @user
    @project = Project.new(create_params)
     if @project.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "projects" ("name", "requirements", "domain", "user_id") VALUES (?, ?, ?, ?)  [["name", "wwww"], ["requirements", "<p>wwwww</p>"], ["domain", "wwwww"], ["user_id", 2]]

  def view1
    @user = User.find(current_user.id)
    authorize! :manage, @user
    @project = Project.where(user_id: current_user.id).page(params[:page]).per(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "projects" WHERE "projects"."user_id" = ? LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 2], ["LIMIT", 1], ["OFFSET", 0]]

   def show
     @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

   def show1
     @user = User.find(current_user.id)
     authorize! :manage, @user
       @project = Project.where(user_id: current_user.id).page(params[:page]).per(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "projects" WHERE "projects"."user_id" = ? LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 2], ["LIMIT", 1], ["OFFSET", 0]]