app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role", "name", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(pram_parms)
    if @user.save